"""
3-Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

Пример:
[1.1, 1.2, 3.1, 5.17, 10.02] => 0.18 или 18
[4.07, 5.1, 8.2444, 6.98] - 0.91 или 91

"""

my_nums = [1.2, 3.4, 2.7, 4.3, 8.5]

excess_nums = [round(my_nums[i] - int(my_nums[i]), 5)
               for i in range(len(my_nums))]
print(round(max(excess_nums) - min(excess_nums), 5))
